<html>
<body>
<h2>Web-sovellusten kehitt&auml;minen Javascriptill&auml; K2020</h2>
<h3> Minka Laasonen </h3>
<p>T&auml;lle sivulle kootaan kurssilla tekem&auml;si Workshop-harjoitukset, sek&auml; my&ouml;s itsen&auml;iset projektit.</p>
<p>&nbsp;</p>
  <h3>Proekti 1:</h3>
<p>To do-lista</p>
<p><a href="https://minkalaa.github.io/To-do-list/">Linkki teht&auml;v&auml;sivuun</a> ja <a href="https://github.com/minkalaa/To-do-list">repositorioon</a></p>

  <h3>Proekti 2:</h3>
<p>Doggo-API</p>
<p><a href="https://minkalaa.github.io/doggo-API/">Linkki teht&auml;v&auml;sivuun</a> ja <a href="https://github.com/minkalaa/doggo-API">repositorioon</a></p>
  
  <h3>Workshop 1:</h3>
<p>Mit&auml; asioita opit t&auml;ss&auml; harjoituksessa?</p>
<p>Mik&auml; j&auml;i askarruttamaan?</p>
<p><a href="#">Linkki teht&auml;v&auml;sivuun</a></p>
<h3>&nbsp;</h3>

  <h3>Workshop 2:</h3>
<p>Mit&auml; asioita opit t&auml;ss&auml; harjoituksessa?</p>
  <p>Opin tekemään satunnaisesti arvottuja lukuja, hyödyntämään ja käyttämään käyttämiäni ohjelmia paremmin. Sivustojen lähdekoodin tarkastelu oli ennestään tuttua, mutta nyt ensimmäisiä kertoja katselin myös konsolia. Opin myös tunnistamaan käyttäjän käyttämän selaimen.</p>
<p>Mik&auml; j&auml;i askarruttamaan?</p>
  <p>Tehtävästä ei tainnut jäädä paljoa askarruttamaan, lähinnä vain kiinnostus tehdä ja oppia lisää.</p>
<p><a href="https://github.com/minkalaa/JS-kurssi/blob/master/ws2.html">Linkki teht&auml;v&auml;sivuun</a></p>
  
  <h3>Workshop 3:</h3>
<p>Mit&auml; asioita opit t&auml;ss&auml; harjoituksessa?</p>
  <p>T&auml;ss&auml; harjoituksessa oli paljon hauskoja juttuja toteuttaa. Esimerkiksi otsikon mousein ja mouseout oli hauska, samoin teksti&auml; vaativa tekstikentt&auml;.</p>
<p>Mik&auml; j&auml;i askarruttamaan?</p>
  <p>Askarruttamaan j&auml;i se, miten google mapsin saisi n&auml;kym&auml;&auml;n, koska en sit&auml; saanut toimimaan. Vastaus olisi varmasti l&ouml;ytynyt, jos olisin vain enemm&auml;n perehtynyt siihen.</p>
<p><a href="https://github.com/minkalaa/JS-kurssi/blob/master/ws3.html">Linkki teht&auml;v&auml;sivuun</a></p>
    
  <h3>Workshop 4:</h3>
<p>Mit&auml; asioita opit t&auml;ss&auml; harjoituksessa?</p>
  <p>Opin oikeastaan kaikenlaista. Erityisesti mieleen jäi animaatio tehtävät, jotka ratkaisin l&auml;hinn&auml; opettajan koodin avulla. Sain silti hyv&auml;n k&auml;sityksen siit&auml;, miten ne toimivat, kun vähän leikin eri arvojen kanssa.</p>
<p>Mik&auml; j&auml;i askarruttamaan?</p>
  <p>Eniten j&auml;i varmaankin askarruttamaan juuri interval asiat, koska niit&auml; ei oltu selitetty kovin tarkasti opettajan materiaaleissa. Kaikki muu oli aika selke&auml;&auml;, kun itse niitä ty&ouml;sti.</p>
<p><a href="https://github.com/minkalaa/JS-kurssi/blob/master/ws4.html">Linkki teht&auml;v&auml;sivuun</a></p>
    
  <h3>Workshop 5:</h3>
<p>Mit&auml; asioita opit t&auml;ss&auml; harjoituksessa?</p>
  <p>Opin smart formeista ja niiden hy&ouml;dynt&auml;misest&auml;.</p>
<p>Mik&auml; j&auml;i askarruttamaan?</p>
  <p>T&auml;m&auml; workshop jäi kesken, koska en saanut funktioita ja muita toimimaan, enk&auml; l&ouml;yt&auml;nyt oikeastaan ohjeitakaan. Lopulta päätin vain anataa olla ja siirtyä seuraavaan workshoppiin.</p>
<p><a href="https://github.com/minkalaa/JS-kurssi/blob/master/ws5.html">Linkki teht&auml;v&auml;sivuun</a></p>
  
  <h3>Workshop 6:</h3>
<p>Mit&auml; asioita opit t&auml;ss&auml; harjoituksessa?</p>
  <p>Opin k&auml;ytt&aml;m&auml;&auml;n local ja sessionstoragea! Mik&auml; olikin yllättävän helppoa.</p>
<p>Mik&auml; j&auml;i askarruttamaan?</p>
  <p>Ei oikeastaan jäänytjuurikaan pohdittavaa, kun sain kaiken toimimaan, niinkuin pitikin.</p>
<p><a href="https://github.com/minkalaa/JS-kurssi/blob/master/ws6.html">Linkki teht&auml;v&auml;sivuun</a></p>
  
  <h3>Workshop 7:</h3>
<p>Mit&auml; asioita opit t&auml;ss&auml; harjoituksessa?</p>
  <p>AJAX kutsujen tekeminen, niiden k&auml;sittely ja parsiminen, mikä oli helpompaa kuin luulinkaan.</p>
<p>Mik&auml; j&auml;i askarruttamaan?</p>
  <p>En saanut viimeistä tehtävää toimimaan (uutissyöte), koska xml linkit eiv&auml;t halunneet toimia. :(</p>
<p><a href="https://github.com/minkalaa/JS-kurssi/blob/master/ws7.html">Linkki teht&auml;v&auml;sivuun</a></p>
  
  <h3>Workshop 8:</h3>
<p>Mit&auml; asioita opit t&auml;ss&auml; harjoituksessa?</p>
  <p>Aluksi vaikutti hankalalta, koska asiat eivät halunneet toimia. Hieman perehdytty&auml; olikin samanlaista, kuin XML. Melkeinp&auml; helpompaakin.</p>
<p>Mik&auml; j&auml;i askarruttamaan?</p>
  <p>En tehnyt teht&auml;v&auml;&auml; 2 ollenkaan, koska API linkki ei toiminut. Tein siltitehtävän 3, joka onnistuikin yllättävän hyvin.</p>
<p><a href="https://github.com/minkalaa/JS-kurssi/blob/master/ws8.html">Linkki teht&auml;v&auml;sivuun</a></p>
</body>
</html>
